In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

1. Write a Pandas program to rename columns of a given DataFrame

Sample data:<br>
Original DataFrame <br>
col1 col2 col3 <br>
0 1 4 7 <br>
1 2 5 8 <br>
2 3 6 9 <br>
New DataFrame after renaming columns: <br>
 Column1 Column2 Column3 <br>
 0 1 4 7 <br>
 1 2 5 8 <br>
 2 3 6 9 <br>

In [4]:
data = {'col1': [1,2,3], 'col2':[4,5,6], 'col3': [7,8,9]}
data

{'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}

In [5]:
df= DataFrame(data)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [6]:
df_renamed = df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
df_renamed

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

2. Write a Pandas program to get the first 3 rows of a given DataFrame

In [7]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df2 = DataFrame(exam_data, index = labels)
df2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [9]:
df2.head(n=3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [10]:
df2.loc[['a','b','c'], ['attempts','name','qualify','score']]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

In [11]:
df2.loc [['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'],
['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

3. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [12]:
number_of_rows = len(df2)
number_of_columns = len(df2.columns)
number_of_rows

10

In [13]:
number_of_columns

4

4. Write a Pandas program to sort this data frame first by 'name' in descending order, then by 'score' in ascending order.

In [14]:
df2.sort_values(by=['name'])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James    NaN         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

In [16]:
df2.sort_values(by=['name', 'score'], ascending = [False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

Write a Pandas program to compute the minimum, 25th percentile, median, 75th, and maximum of a given series.

In [17]:
# Assuming 'series_data' is your pandas Series
# Replace this with your actual Series data
series_data = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

# Using describe to compute the statistics
stats = series_data.describe(percentiles=[.25, .5, .75])

# Renaming the 50% index to 'median' for clarity
stats = stats.rename(index={'50%': 'median'})

print(stats)

count     10.00000
mean       5.50000
std        3.02765
min        1.00000
25%        3.25000
median     5.50000
75%        7.75000
max       10.00000
dtype: float64

Write a Pandas program to add one row in an existing DataFrame.

In [22]:
# Example DataFrame
data = {
    'Column1': [1, 2, 3],
    'Column2': ['A', 'B', 'C']
}
df = pd.DataFrame(data)

new_row = pd.DataFrame({'Column1': [4], 'Column2': ['D']})

# Adding the new row
df = pd.concat([df, new_row], ignore_index=True)

df

   Column1 Column2
0        1       A
1        2       B
2        3       C
3        4       D

Write a Pandas program to select a specific row of given series/dataframe by integer index.

In [24]:
# Assuming series is your Series
series = pd.Series([10, 20, 30, 40, 50])

# Select the value at index position 3 (fourth value)
selected_value = series.iloc[3]
selected_value

40

Write a Pandas program to print a DataFrame without index.

In [25]:
df = pd.DataFrame({
    'Column1': [1, 2, 3, 4],
    'Column2': ['A', 'B', 'C', 'D']
})

# Print DataFrame without the index
print(df.to_string(index=False))

 Column1 Column2
       1       A
       2       B
       3       C
       4       D